Tekla Open API Reference for Tekla Structures 2025
DimensionSetBaseAttributes.DimensionPlacingAttributes.Direction Property
 The placing direction.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PlacingDirectionAttributes Direction { get; set; }
Public Property Direction As PlacingDirectionAttributes
	Get
	Set
Property Value
Type: PlacingDirectionAttributes
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
Tekla.Structures.Drawing Namespace